# Object creation (2024-01-26)

In [2]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.613730 -0.155988  0.144012  0.691079
2013-01-02  2.370234 -0.089050  0.512117  0.265821
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447
2013-01-04  0.013759  1.249067 -0.514043 -0.645312
2013-01-05  0.274511 -1.840934  0.932437 -1.155326
2013-01-06  0.173177  0.764002 -0.635870  0.958819

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1,index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo", #특이한게 ,로 끝내도 되고 아닌 것으로 끝내도 되네?
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
#df2.<TAB> # noqa: E225, E999

#df2.까지 입력후 탭누르라는 의미, vscode에서는 탭안눌러도 자동으로 표시 단 컬럼은 안 표시됨

# Viewing data (2024-01-27)

In [9]:
df.head()

                   A         B         C         D
2013-01-01  0.613730 -0.155988  0.144012  0.691079
2013-01-02  2.370234 -0.089050  0.512117  0.265821
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447
2013-01-04  0.013759  1.249067 -0.514043 -0.645312
2013-01-05  0.274511 -1.840934  0.932437 -1.155326

In [10]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.013759  1.249067 -0.514043 -0.645312
2013-01-05  0.274511 -1.840934  0.932437 -1.155326
2013-01-06  0.173177  0.764002 -0.635870  0.958819

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.to_numpy()

array([[ 0.61372968, -0.15598785,  0.14401171,  0.69107894],
       [ 2.37023433, -0.08904966,  0.51211678,  0.26582147],
       [-0.03837801, -0.12208878, -1.07605061,  1.65744707],
       [ 0.01375914,  1.24906685, -0.51404263, -0.64531195],
       [ 0.27451078, -1.84093359,  0.9324367 , -1.15532637],
       [ 0.17317739,  0.76400221, -0.63586972,  0.95881908]])

In [14]:
df.values

array([[ 0.61372968, -0.15598785,  0.14401171,  0.69107894],
       [ 2.37023433, -0.08904966,  0.51211678,  0.26582147],
       [-0.03837801, -0.12208878, -1.07605061,  1.65744707],
       [ 0.01375914,  1.24906685, -0.51404263, -0.64531195],
       [ 0.27451078, -1.84093359,  0.9324367 , -1.15532637],
       [ 0.17317739,  0.76400221, -0.63586972,  0.95881908]])

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [17]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.567839 -0.032498 -0.106233  0.295421
std    0.912912  1.055816  0.763044  1.043291
min   -0.038378 -1.840934 -1.076051 -1.155326
25%    0.053614 -0.147513 -0.605413 -0.417529
50%    0.223844 -0.105569 -0.185015  0.478450
75%    0.528925  0.550739  0.420091  0.891884
max    2.370234  1.249067  0.932437  1.657447

In [19]:
df.T
#행과 열을 바꿔주는데 미리 계산되어 있음
#메소드가 아닌 속성임

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.613730    2.370234   -0.038378    0.013759    0.274511    0.173177
B   -0.155988   -0.089050   -0.122089    1.249067   -1.840934    0.764002
C    0.144012    0.512117   -1.076051   -0.514043    0.932437   -0.635870
D    0.691079    0.265821    1.657447   -0.645312   -1.155326    0.958819

In [20]:
df.T.index
#값만 바꿔서 나타내는가해서 확인용으로 해줬는데 인덱스도 확실히 바뀌어있다

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df.sort_index(axis=1, ascending=False)
#axis = 1 하면 열끼리 정렬하는 것

                   D         C         B         A
2013-01-01  0.691079  0.144012 -0.155988  0.613730
2013-01-02  0.265821  0.512117 -0.089050  2.370234
2013-01-03  1.657447 -1.076051 -0.122089 -0.038378
2013-01-04 -0.645312 -0.514043  1.249067  0.013759
2013-01-05 -1.155326  0.932437 -1.840934  0.274511
2013-01-06  0.958819 -0.635870  0.764002  0.173177

In [22]:
df.sort_values(by="B")
#df안에 있는 특정 열의 값에 대해서 정렬해줄 수 있음

                   A         B         C         D
2013-01-05  0.274511 -1.840934  0.932437 -1.155326
2013-01-01  0.613730 -0.155988  0.144012  0.691079
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447
2013-01-02  2.370234 -0.089050  0.512117  0.265821
2013-01-06  0.173177  0.764002 -0.635870  0.958819
2013-01-04  0.013759  1.249067 -0.514043 -0.645312

# Selection (2024-01-28)

## Getitem ([])

In [23]:
df["A"]

2013-01-01    0.613730
2013-01-02    2.370234
2013-01-03   -0.038378
2013-01-04    0.013759
2013-01-05    0.274511
2013-01-06    0.173177
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01  0.613730 -0.155988  0.144012  0.691079
2013-01-02  2.370234 -0.089050  0.512117  0.265821
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447

In [25]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  2.370234 -0.089050  0.512117  0.265821
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447
2013-01-04  0.013759  1.249067 -0.514043 -0.645312

## Selection by label

In [26]:
df.loc[dates[0]]

A    0.613730
B   -0.155988
C    0.144012
D    0.691079
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[dates[0],:]

A    0.613730
B   -0.155988
C    0.144012
D    0.691079
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  0.613730 -0.155988
2013-01-02  2.370234 -0.089050
2013-01-03 -0.038378 -0.122089
2013-01-04  0.013759  1.249067
2013-01-05  0.274511 -1.840934
2013-01-06  0.173177  0.764002

In [29]:
df.loc["20130102":"20130104",["A","B"]]

                   A         B
2013-01-02  2.370234 -0.089050
2013-01-03 -0.038378 -0.122089
2013-01-04  0.013759  1.249067

In [30]:
df.loc["20130102":"20130104",["B","A"]]

                   B         A
2013-01-02 -0.089050  2.370234
2013-01-03 -0.122089 -0.038378
2013-01-04  1.249067  0.013759

In [31]:
df.loc[dates[0],"A"]

0.6137296816437173

In [32]:
df.at[dates[0],"A"]

0.6137296816437173

## Selection by position

In [33]:
df.iloc[3]

A    0.013759
B    1.249067
C   -0.514043
D   -0.645312
Name: 2013-01-04 00:00:00, dtype: float64

In [34]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.013759  1.249067
2013-01-05  0.274511 -1.840934

In [35]:
#비교 loc는 슬라이싱 할때 끝부분까지로 인식(끝부분 포함됨) iloc는 끝부분제외
#df.loc[3:5, 0:2] 아 맞다 이런 식으로 숫자 인덱스로 안됬다
df.loc["20130104":"20130105", "A":"B"]

                   A         B
2013-01-04  0.013759  1.249067
2013-01-05  0.274511 -1.840934

In [36]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  2.370234  0.512117
2013-01-03 -0.038378 -1.076051
2013-01-05  0.274511  0.932437

In [37]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  2.370234 -0.089050  0.512117  0.265821
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447

In [38]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.155988  0.144012
2013-01-02 -0.089050  0.512117
2013-01-03 -0.122089 -1.076051
2013-01-04  1.249067 -0.514043
2013-01-05 -1.840934  0.932437
2013-01-06  0.764002 -0.635870

In [39]:
df.iloc[1,1]

-0.08904966090523071

In [40]:
df.iat[1,1]

-0.08904966090523071

## Boolean indexing (조건에 따른 컬럼 선택)

In [41]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.613730 -0.155988  0.144012  0.691079
2013-01-02  2.370234 -0.089050  0.512117  0.265821
2013-01-04  0.013759  1.249067 -0.514043 -0.645312
2013-01-05  0.274511 -1.840934  0.932437 -1.155326
2013-01-06  0.173177  0.764002 -0.635870  0.958819

In [42]:
df[df>0]

                   A         B         C         D
2013-01-01  0.613730       NaN  0.144012  0.691079
2013-01-02  2.370234       NaN  0.512117  0.265821
2013-01-03       NaN       NaN       NaN  1.657447
2013-01-04  0.013759  1.249067       NaN       NaN
2013-01-05  0.274511       NaN  0.932437       NaN
2013-01-06  0.173177  0.764002       NaN  0.958819

In [43]:
df2=df.copy()
df2["E"]=["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.613730 -0.155988  0.144012  0.691079    one
2013-01-02  2.370234 -0.089050  0.512117  0.265821    one
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447    two
2013-01-04  0.013759  1.249067 -0.514043 -0.645312  three
2013-01-05  0.274511 -1.840934  0.932437 -1.155326   four
2013-01-06  0.173177  0.764002 -0.635870  0.958819  three

In [44]:
df2[df2["E"].isin(["two", "four"])]
#isin()안에 []로 넣어야하는 듯 (한 개의 경우에도)

                   A         B         C         D     E
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447   two
2013-01-05  0.274511 -1.840934  0.932437 -1.155326  four

## Setting

In [45]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [46]:
df["F"]=s1

In [47]:
df.at[dates[0],"A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.155988  0.144012  0.691079  NaN
2013-01-02  2.370234 -0.089050  0.512117  0.265821  1.0
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447  2.0
2013-01-04  0.013759  1.249067 -0.514043 -0.645312  3.0
2013-01-05  0.274511 -1.840934  0.932437 -1.155326  4.0
2013-01-06  0.173177  0.764002 -0.635870  0.958819  5.0

In [48]:
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.144012  0.691079  NaN
2013-01-02  2.370234 -0.089050  0.512117  0.265821  1.0
2013-01-03 -0.038378 -0.122089 -1.076051  1.657447  2.0
2013-01-04  0.013759  1.249067 -0.514043 -0.645312  3.0
2013-01-05  0.274511 -1.840934  0.932437 -1.155326  4.0
2013-01-06  0.173177  0.764002 -0.635870  0.958819  5.0

In [49]:
len(df)

6

In [50]:
df.loc[:, "D"] = np.array([5]*len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.144012  5.0  NaN
2013-01-02  2.370234 -0.089050  0.512117  5.0  1.0
2013-01-03 -0.038378 -0.122089 -1.076051  5.0  2.0
2013-01-04  0.013759  1.249067 -0.514043  5.0  3.0
2013-01-05  0.274511 -1.840934  0.932437  5.0  4.0
2013-01-06  0.173177  0.764002 -0.635870  5.0  5.0

In [51]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.144012 -5.0  NaN
2013-01-02 -2.370234 -0.089050 -0.512117 -5.0 -1.0
2013-01-03 -0.038378 -0.122089 -1.076051 -5.0 -2.0
2013-01-04 -0.013759 -1.249067 -0.514043 -5.0 -3.0
2013-01-05 -0.274511 -1.840934 -0.932437 -5.0 -4.0
2013-01-06 -0.173177 -0.764002 -0.635870 -5.0 -5.0

# Missing data (2024-01-29)

In [52]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df.loc[dates[0]:dates[1], "E"] = 1
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000  0.144012  5.0  NaN NaN
2013-01-02  2.370234 -0.089050  0.512117  5.0  1.0 NaN
2013-01-03 -0.038378 -0.122089 -1.076051  5.0  2.0 NaN
2013-01-04  0.013759  1.249067 -0.514043  5.0  3.0 NaN

In [53]:
df1.dropna(how="any") #결측치 있으면 다 제거하는 옵션인듯?

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [54]:
df1.fillna(value=5) #결측치를 특정 값으로 다 바꿔서 채우는 방법

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.144012  5.0  5.0  5.0
2013-01-02  2.370234 -0.089050  0.512117  5.0  1.0  5.0
2013-01-03 -0.038378 -0.122089 -1.076051  5.0  2.0  5.0
2013-01-04  0.013759  1.249067 -0.514043  5.0  3.0  5.0

In [55]:
pd.isna(df1) #결측치가 있는가에 대한 T/F판단 있으면 T

                A      B      C      D      F     E
2013-01-01  False  False  False  False   True  True
2013-01-02  False  False  False  False  False  True
2013-01-03  False  False  False  False  False  True
2013-01-04  False  False  False  False  False  True

# Operations (2024-01-30)

## Stats

In [56]:
df

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.144012  5.0  NaN  1.0
2013-01-02  2.370234 -0.089050  0.512117  5.0  1.0  1.0
2013-01-03 -0.038378 -0.122089 -1.076051  5.0  2.0  NaN
2013-01-04  0.013759  1.249067 -0.514043  5.0  3.0  NaN
2013-01-05  0.274511 -1.840934  0.932437  5.0  4.0  NaN
2013-01-06  0.173177  0.764002 -0.635870  5.0  5.0  NaN

In [57]:
df.mean() #NaN값있으면 합산, 갯수에서 제외하고 평균 내는 듯

A    0.465551
B   -0.006500
C   -0.106233
D    5.000000
F    3.000000
E    1.000000
dtype: float64

In [58]:
print(df.mean(axis=1)) 
# 마찬가지로 NaN값있으면 합산, 갯수에서 제외하고 평균 내는 듯, 단 axis=1이면 행 별로 모든 컬럼의 값의 평균 내줌
# axis = 1말고 그냥 인자로 1만 줘도 동일한 결과가 나오는 듯 함

2013-01-01    1.228802
2013-01-02    1.632217
2013-01-03    1.152697
2013-01-04    1.749757
2013-01-05    1.673203
2013-01-06    2.060262
Freq: D, dtype: float64

In [59]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [60]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

>https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series     
Series의 메소드인 shift가 뭐하는 녀석인지 몰라서 문서에 들어가보니 아래와 같이 서술되어있었다   
shift([periods, freq, axis, fill_value, suffix])    
Shift index by desired number of periods with an optional time freq.    
자세한 내용은 모르겠지만 대강 값들을 index를 기준으로 준 값만큼 이동시키는 듯하다   
1일과 2일의 경우 이전 인덱스에 해당하는 데이터가 없으니 NaN로 결측치가 된 것이고    
3,4,5일의 경우 인덱스상으로 2이전의 값들이 존재했으니 해당값들로 바뀌었고   
6일의 경우 인덱스상으로 2이전의 값이 NaN로 결측치 였기에 결측치로 되었는 듯하다.

In [61]:
df.sub(s, axis='index')

                   A         B         C    D    F   E
2013-01-01       NaN       NaN       NaN  NaN  NaN NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN NaN
2013-01-03 -1.038378 -1.122089 -2.076051  4.0  1.0 NaN
2013-01-04 -2.986241 -1.750933 -3.514043  2.0  0.0 NaN
2013-01-05 -4.725489 -6.840934 -4.067563  0.0 -1.0 NaN
2013-01-06       NaN       NaN       NaN  NaN  NaN NaN

>https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame
이번엔 df의 메소드인 sub에 대하여 설명이 없어서 찾아보니 아래와 같이 메소드로 설명되어있었고 잘 이해가 되지 않아 좀더 자세한 독스에 들어갔다    
sub(other[, axis, level, fill_value])       
Get Subtraction of dataframe and other, element-wise (binary operator sub).     
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sub.html#pandas.DataFrame.sub   
DataFrame.sub(other, axis='columns', level=None, fill_value=None)   
대강 구조를 보니 df에 대하여 빼기를 해주는데 sub()안에 들어있는 값으로 빼주는 것으로 들어올 수 있는 other로는 scalar, sequence, Series, dict or DataFrame이 가능하다고 한다 이중 sequence는 정확히 뭔지 모르겠어서 찾아보니     
https://wikidocs.net/84391      
내용을 참고하였다 대강 리스트, 문자열, 튜플 이 세가지 자료형이라고 생각하면 될듯하다    
그리고 axis에 대하여 0 or index , 1 or columns의 옵션이 있는데 기본값은 colunms로 되어있다  
fill_value는 결측치를 만났을 때 특정값으로 바꿔넣어줄 것인지 선택하는 옵션으로 기본값은 none로 되어있다     
level 옵션에 대해서는 잘모르겠다 예제도 한문제 뿐인데 잘 이해가 되지 않는다 대강 멀티인덱스를 사용할 경우에 사용하는 느낌인데 예제를 아래 그대로 가져와서 해보고 이해해보도록 하겠다

### level 예제

In [62]:
level_example_df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])
level_example_df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [63]:
level_example_df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])
level_example_df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [64]:
print(level_example_df.div(level_example_df_multindex, level=1))
#원래 예제에는 ,fill_value=0으로 결측치 0으로 바꿔주는 옵션이 추가되어있었다
#뭔가 알듯말듯한데 chatGPT를 통해 설명을 들으니 알 것 같았다
#https://chat.openai.com/share/73654015-96b4-4fb3-b6e3-243526afb670

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        NaN      NaN
  pentagon      NaN      NaN
  hexagon       NaN      NaN

## User defined functions

In [65]:
display(df)
print(df.mean(),'\n')
print(df.mean()*5.6)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.144012  5.0  NaN  1.0
2013-01-02  2.370234 -0.089050  0.512117  5.0  1.0  1.0
2013-01-03 -0.038378 -0.122089 -1.076051  5.0  2.0  NaN
2013-01-04  0.013759  1.249067 -0.514043  5.0  3.0  NaN
2013-01-05  0.274511 -1.840934  0.932437  5.0  4.0  NaN
2013-01-06  0.173177  0.764002 -0.635870  5.0  5.0  NaN

A    0.465551
B   -0.006500
C   -0.106233
D    5.000000
F    3.000000
E    1.000000
dtype: float64

A     2.607083
B    -0.036403
C    -0.594905
D    28.000000
F    16.800000
E     5.600000
dtype: float64

In [66]:
df.agg(lambda x: np.mean(x)*5.6)

A     2.607083
B    -0.036403
C    -0.594905
D    28.000000
F    16.800000
E     5.600000
dtype: float64

In [67]:
df*101.2

                     A           B           C      D      F      E
2013-01-01    0.000000    0.000000   14.573985  506.0    NaN  101.2
2013-01-02  239.867715   -9.011826   51.826219  506.0  101.2  101.2
2013-01-03   -3.883855  -12.355385 -108.896321  506.0  202.4    NaN
2013-01-04    1.392425  126.405565  -52.021114  506.0  303.6    NaN
2013-01-05   27.780491 -186.302479   94.362594  506.0  404.8    NaN
2013-01-06   17.525552   77.317023  -64.350016  506.0  506.0    NaN

In [68]:
df.transform(lambda x: x*101.2)

                     A           B           C      D      F      E
2013-01-01    0.000000    0.000000   14.573985  506.0    NaN  101.2
2013-01-02  239.867715   -9.011826   51.826219  506.0  101.2  101.2
2013-01-03   -3.883855  -12.355385 -108.896321  506.0  202.4    NaN
2013-01-04    1.392425  126.405565  -52.021114  506.0  303.6    NaN
2013-01-05   27.780491 -186.302479   94.362594  506.0  404.8    NaN
2013-01-06   17.525552   77.317023  -64.350016  506.0  506.0    NaN

agg는 대강은 알듯한데 transform은 agg와 뭐가 다른지 모르겠다    
추가로 유사한 것에 apply도 있던 것으로 기억하는데 여기는 왜 빠져있고 차이가 뭔지도 궁금하다     
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html#pandas.DataFrame.agg   
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.transform.html#pandas.DataFrame.transform   
https://pandas.pydata.org/pandas-docs/stable/user_guide/gotchas.html#gotchas-udf-mutation   
chatGPT에게 차이를 물어본 내용:
https://chat.openai.com/share/654feb01-8d50-481e-8c7a-ca160e1e74a4

## Value Counts

In [69]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    4
1    0
2    5
3    1
4    4
5    3
6    0
7    4
8    6
9    3
dtype: int32

In [70]:
s.value_counts()

4    3
0    2
3    2
5    1
1    1
6    1
Name: count, dtype: int64

## String Methods

In [71]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
print(s)
s.str.lower()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

pandas.Series:
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series     
Vectorized String Methods:
https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods

# Merge (2024-01-31)

## Concat

In [72]:
df = pd.DataFrame(np.random.randn(10,4)) 
#np.random.randn(m,n) : 평균0, 표준편차1의 가우시안 표준정규분포 난수를 matrix array(m,n) 생성
df

          0         1         2         3
0 -0.470946 -0.310833 -0.491949 -0.241215
1 -0.703907  0.949594  1.497145 -0.247894
2 -0.372818  0.159939 -0.576952  0.443673
3  1.993743 -0.043537 -2.417816 -2.305172
4 -0.968700  0.005151  0.245683 -0.404239
5 -0.801588 -1.240667  0.662725  1.136981
6 -1.948731  0.708818 -0.401112  0.344961
7  0.616040 -0.218706  0.387856 -1.285365
8  0.160366  0.714764 -0.086996  0.939794
9 -1.241957 -0.461045  0.899251  0.856947

np.random.randn(m,n) https://nittaku.tistory.com/443    
docs : https://numpy.org/doc/stable/reference/random/generated/numpy.random.randn.html

In [73]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.470946 -0.310833 -0.491949 -0.241215
 1 -0.703907  0.949594  1.497145 -0.247894
 2 -0.372818  0.159939 -0.576952  0.443673,
           0         1         2         3
 3  1.993743 -0.043537 -2.417816 -2.305172
 4 -0.968700  0.005151  0.245683 -0.404239
 5 -0.801588 -1.240667  0.662725  1.136981
 6 -1.948731  0.708818 -0.401112  0.344961,
           0         1         2         3
 7  0.616040 -0.218706  0.387856 -1.285365
 8  0.160366  0.714764 -0.086996  0.939794
 9 -1.241957 -0.461045  0.899251  0.856947]

In [74]:
pd.concat(pieces)

          0         1         2         3
0 -0.470946 -0.310833 -0.491949 -0.241215
1 -0.703907  0.949594  1.497145 -0.247894
2 -0.372818  0.159939 -0.576952  0.443673
3  1.993743 -0.043537 -2.417816 -2.305172
4 -0.968700  0.005151  0.245683 -0.404239
5 -0.801588 -1.240667  0.662725  1.136981
6 -1.948731  0.708818 -0.401112  0.344961
7  0.616040 -0.218706  0.387856 -1.285365
8  0.160366  0.714764 -0.086996  0.939794
9 -1.241957 -0.461045  0.899251  0.856947

## Join

In [75]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [76]:
right

   key  rval
0  foo     4
1  foo     5

In [77]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [78]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [79]:
right

   key  rval
0  foo     4
1  bar     5

In [80]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Grouping (2024-02-01)

Splitting the data into groups based on some criteria

Applying a function to each group independently

Combining the results into a data structure

In [81]:
df = pd.DataFrame(
    {"A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"], 
     "B": ["one", "one", "two", "three", "two", "two", "one", "three"], 
     "C": np.random.randn(8),
     "D": np.random.randn(8),}
)
df

     A      B         C         D
0  foo    one -0.100451 -0.101484
1  bar    one -0.443136 -1.152298
2  foo    two -0.412857  0.062645
3  bar  three -0.253695  0.750196
4  foo    two -0.038335 -0.179522
5  bar    two -0.540749 -1.781303
6  foo    one  0.103952  1.348287
7  foo  three  2.258386  0.559533

In [82]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar -1.237580 -2.183405
foo  1.810694  1.689459

In [83]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -0.443136 -1.152298
    three -0.253695  0.750196
    two   -0.540749 -1.781303
foo one    0.003501  1.246803
    three  2.258386  0.559533
    two   -0.451192 -0.116877

# Reshaping (2024-02-02)

## Stack

In [84]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"], 
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names = ["first", "second"])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=["A", "B"])
df2 = df[:4]
df2

                     A         B
first second
bar   one     1.113975  0.005170
      two    -1.050023  0.104316
baz   one     0.532731  0.586561
      two    -0.244992  0.593828

In [85]:
stacked = df2.stack() #future_stack=True
stacked #왜인지는 모르겠지만 저 옵션 빼줘야 제대로 실행됨 결과는 그리 다르지 않은 것으로 보임 나중에 질문해보기

first  second
bar    one     A    1.113975
               B    0.005170
       two     A   -1.050023
               B    0.104316
baz    one     A    0.532731
               B    0.586561
       two     A   -0.244992
               B    0.593828
dtype: float64

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.stack.html#pandas.DataFrame.stack   
부분을 보니 pandas2.0에서 pandas 3.0의 방식을 사용할 때 해주던 방식으로 유추되는데

In [86]:
pd.__version__

'2.0.3'

2.0버전 쓰고 있는 것이 맞는데 왜 안되는 거지..?

In [87]:
stacked.unstack()

                     A         B
first second
bar   one     1.113975  0.005170
      two    -1.050023  0.104316
baz   one     0.532731  0.586561
      two    -0.244992  0.593828

In [88]:
stacked.unstack(1) # 행열 바꿔서 해제하는듯?

second        one       two
first
bar   A  1.113975 -1.050023
      B  0.005170  0.104316
baz   A  0.532731 -0.244992
      B  0.586561  0.593828

In [89]:
stacked.unstack(0) # 무슨 방식으로 바꾸는지는 모르겠지만 째든 바꿔서 해제하는듯

first          bar       baz
second
one    A  1.113975  0.532731
       B  0.005170  0.586561
two    A -1.050023 -0.244992
       B  0.104316  0.593828

## Pivot tables

In [90]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  A  foo -2.311456 -0.106915
1     one  B  foo  1.448513 -0.002523
2     two  C  foo  0.471940 -0.071924
3   three  A  bar  0.000633 -0.035137
4     one  B  bar  1.177759 -0.444117
5     one  C  bar -0.696013 -2.280803
6     two  A  foo -0.673481  0.475604
7   three  B  foo  1.234430  0.718330
8     one  C  foo  0.462008  0.671026
9     one  A  bar  0.755268  1.374621
10    two  B  bar -0.330554 -2.323377
11  three  C  bar -0.085087 -0.464072

In [91]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A  0.755268 -2.311456
      B  1.177759  1.448513
      C -0.696013  0.462008
three A  0.000633       NaN
      B       NaN  1.234430
      C -0.085087       NaN
two   A       NaN -0.673481
      B -0.330554       NaN
      C       NaN  0.471940

자동으로 commit되게 yml추가해준 것 테스트용도

# Time series (2024-02-03)

시계열 데이터에서 1초 마다 측정된 데이터를 5분 마다 측정된 데이터의 형태로 바꾸고 싶을 때 어떻게 해야하는지     
그리고 그 시계열 단위인 주기(frequency)를 다시 샘플링 할 수 있음

In [92]:
rng = pd.date_range("1/1/2012", periods=100, freq ="s") #대강 시작기준날짜, 몇개, (데이터간 차이나는)단위 느낌인듯하다
ts = pd.Series(np.random.randint(0,500,len(rng)), index=rng)
ts.resample("5Min").sum()

2012-01-01    24590
Freq: 5T, dtype: int32

#### resample에 대하여

In [93]:
idx = pd.date_range("2018-01-01", periods=5, freq="h")
ts2 = pd.Series(range(len(idx)), index=idx)
ts2

2018-01-01 00:00:00    0
2018-01-01 01:00:00    1
2018-01-01 02:00:00    2
2018-01-01 03:00:00    3
2018-01-01 04:00:00    4
Freq: H, dtype: int64

In [94]:
ts2.resample("2h").mean()

2018-01-01 00:00:00    0.5
2018-01-01 02:00:00    2.5
2018-01-01 04:00:00    4.0
Freq: 2H, dtype: float64

In [95]:
print(type(ts2))

<class 'pandas.core.series.Series'>

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.resample.html#pandas.Series.resample   
우선 2.0.0버전 이후로는 사라지게 될 듯한 기능이며 후에는 frame.T.resample을 대신 사용하라고 한다    
(지금 내가 사용하는 pandas 버전이 2.0.3인데 아직 존재는 하는듯하다?)    
resample: https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-resampling     
흠 frame.T.resample이 뭔지 궁금해서 검색했는데 따로 나오지는 않은 것같다    
(Dataframe.T정도는 있긴한데 다른내용으로 행과 열을 바꿔주는 transpose를 의미하는 듯하다)   
그리고 그냥 series, df, df의 groupby했을때 series와 df 모두에 사용가능한 듯하다     
그런데 쓰이는 파라미터의 rule에 대해서 어떤 것을 쓸 수 있는 지 궁금해서 알고 싶은데 그냥 DataOffset, Timedelta or str로 적혀있다    
현재 예제들로 확인 된 것은 str으로 적을 때 숫자+ 시간은 'h', 초는 's', 분은 month의 m과 중복되서 그런지 'min'로 쓰이는 것을 확인하였다      
관련한 듯한 내용: https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#dateoffset-objects   
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.tseries.offsets.DateOffset.html#pandas.tseries.offsets.DateOffset      
timedelta: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Timedelta.html#pandas.Timedelta   
GPT한테 물어봐도 https://chat.openai.com/share/4e050491-79e0-44a5-bd1d-38a4f2d1e92f     
크게 다르진 않는 듯하다     
그냥 관련한 듯한 내용에 적힌 string부분을 참고하는 것만으로도 충분한듯 하다

In [96]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts = pd.Series(np.random.random(len(rng)),rng)
ts

2012-03-06    0.070345
2012-03-07    0.290614
2012-03-08    0.980420
2012-03-09    0.984008
2012-03-10    0.641380
Freq: D, dtype: float64

In [97]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00    0.070345
2012-03-07 00:00:00+00:00    0.290614
2012-03-08 00:00:00+00:00    0.980420
2012-03-09 00:00:00+00:00    0.984008
2012-03-10 00:00:00+00:00    0.641380
Freq: D, dtype: float64

In [98]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    0.070345
2012-03-06 19:00:00-05:00    0.290614
2012-03-07 19:00:00-05:00    0.980420
2012-03-08 19:00:00-05:00    0.984008
2012-03-09 19:00:00-05:00    0.641380
Freq: D, dtype: float64

In [99]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [100]:
rng + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)